; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v2)
             (pred_5 ?v9 ?v4)
             (pred_12 ?v7 ?v4)
             (pred_4 ?v12 ?v7 )
	     (pred_7 ?v7)
             (pred_3 ?v11)
             (pred_8 ?v9)
             (pred_10 ?v4)
             (pred_11 ?v7)
             (pred_6 ?v9)
             (pred_2 ?v7)
             (pred_1 ))



(:action op_4
:parameters (?v6 ?v13 ?v3 ?v1)
:precondition (and (pred_3 ?v6) (pred_3 ?v13) (pred_8 ?v3) (pred_10 ?v1)
          (pred_9 ?v6 ?v13) (pred_5 ?v3 ?v1)
                   (pred_12 ?v13 ?v1) (pred_7 ?v6) 
                   (pred_11 ?v13) (pred_6 ?v3))
:effect (and  (pred_2 ?v13) (not (pred_11 ?v13))))


(:action op_5
:parameters (?v6 ?v10)
:precondition (and (pred_3 ?v6) (pred_3 ?v10)
               (pred_7 ?v6) (pred_9 ?v6 ?v10) (pred_2 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v6))))

(:action op_3
:parameters (?v6 ?v3)
:precondition (and (pred_3 ?v6) (pred_8 ?v3) 
                  (pred_7 ?v6) (pred_4 ?v3 ?v6) (pred_1 ))
:effect (and (pred_6 ?v3)
   (not (pred_4 ?v3 ?v6)) (not (pred_1 ))))


(:action op_1
:parameters (?v6 ?v8 ?v5)
:precondition (and (pred_3 ?v6) (pred_8 ?v8) (pred_8 ?v5)
                  (pred_7 ?v6) (pred_6 ?v5) (pred_4 ?v8 ?v6))
:effect (and (pred_6 ?v8) (pred_4 ?v5 ?v6)
        (not (pred_6 ?v5)) (not (pred_4 ?v8 ?v6))))

(:action op_2
:parameters (?v6 ?v3)
:precondition (and (pred_3 ?v6) (pred_8 ?v3) 
                  (pred_7 ?v6) (pred_6 ?v3))
:effect (and (pred_1 ) (pred_4 ?v3 ?v6) (not (pred_6 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_11 obj_02 obj_16 obj_17 obj_04 obj_06 obj_20 obj_01 obj_19 obj_10 obj_15 obj_13 obj_08 obj_12 obj_09
    obj_03 obj_07
    obj_14 obj_18
    )

    (:init
       (pred_1)

       (pred_3 obj_05)
       (pred_3 obj_11)
       (pred_3 obj_02)
       (pred_3 obj_16)
       (pred_3 obj_17)
       (pred_3 obj_04)
       (pred_3 obj_06)
       (pred_3 obj_20)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_08)
       (pred_3 obj_12)
       (pred_3 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_8 obj_14)
       (pred_8 obj_18)

       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_02 obj_06)
       (pred_9 obj_02 obj_16)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_02)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_19 obj_08)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_19)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_12)
       (pred_11 obj_06)
       (pred_11 obj_04)
       (pred_12  obj_06 obj_03)
       (pred_12  obj_04 obj_07)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_16)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_13)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_09)

       (pred_5  obj_14 obj_03)
       (pred_5  obj_18 obj_07)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_18 obj_20)
       (pred_7 obj_16)
    )

    (:goal (and
       (pred_4 obj_18 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_02)))
)
)

; plan
1. (op_5 obj_16 obj_20)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_18)
   deleted: (pred_4 obj_18 obj_20) (pred_1)
   added: (pred_6 obj_18)
   goals met: 0 of 1
3. (op_5 obj_20 obj_15)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_10)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_10)
   goals met: 0 of 1
5. (op_5 obj_10 obj_19)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_19)
   goals met: 0 of 1
6. (op_4 obj_19 obj_04 obj_18 obj_07)
   deleted: (pred_11 obj_04)
   added: (pred_2 obj_04)
   goals met: 0 of 1
7. (op_5 obj_19 obj_04)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_04)
   goals met: 0 of 1
8. (op_5 obj_04 obj_11)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_11)
   goals met: 0 of 1
9. (op_2 obj_11 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_1) (pred_4 obj_18 obj_11)
   goals met: 1 of 1
